Revit 2023 API
GroupTypeId.RailingSystemSegmentPosts Property
 "Posts"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId RailingSystemSegmentPosts { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemSegmentPosts As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemSegmentPosts {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace